tap "codecrafters-io/tap"
tap "daveshanley/vacuum"
tap "felixkratz/formulae"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "gettext"
brew "bash"
brew "node"
brew "bash-language-server"
brew "bat"
brew "bc"
brew "btop"
brew "c10t"
brew "python@3.13"
brew "llvm"
brew "ccls"
brew "chafa"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "cmatrix"
brew "colima", restart_service: :changed
brew "coreutils"
brew "cowsay"
brew "cppcheck"
brew "cunit"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "dotenv-linter"
brew "doxygen"
brew "fastfetch"
brew "fd"
brew "gcc"
brew "fish"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghex"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "glab"
brew "glow"
brew "gnu-sed"
brew "go"
brew "gtk+"
brew "gtk+3"
brew "htop"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "json-glib"
brew "jupyterlab"
brew "lazygit"
brew "less"
brew "lf"
brew "libsixel"
brew "lld"
brew "lolcat"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "ninja"
brew "meson"
brew "mpc"
brew "mpd", restart_service: :changed
brew "mpv"
brew "mupdf"
brew "nasm"
brew "ncdu"
brew "neovim"
brew "nushell"
brew "pipes-sh"
brew "pipx"
brew "pngpaste"
brew "podman"
brew "prettierd"
brew "pyenv"
brew "qemu"
brew "qt"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "selene"
brew "shellcheck"
brew "sk"
brew "spotify_player"
brew "stylua"
brew "tectonic"
brew "tmux"
brew "tree"
brew "vite"
brew "wget"
brew "xxh"
brew "yaml-language-server"
brew "yarn"
brew "zk"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "codecrafters-io/tap/codecrafters"
brew "daveshanley/vacuum/vacuum"
brew "felixkratz/formulae/sketchybar"
brew "jstkdng/programs/ueberzugpp"
cask "aerospace"
cask "font-monaspace-nerd-font"
cask "font-noto-sans-symbols-2"
cask "iterm2"
cask "kitty"
cask "metasploit"
cask "pycharm"
cask "skim"
cask "visual-studio-code"
cask "whisky"
cask "xquartz"

# Vscode and nvim-dap packages
vscode "adrianwilczynski.terminal-commands"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "dart-code.dart-code"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "ekelley.midnight-synth"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "icrawl.discord-vscode"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "xabikos.javascriptsnippets"
